app/Controllers/Api/EmployeeController.php

SELECT *
FROM `employees`
WHERE `employees`.`id` = '1\n'
---

			$emp = new EmployeeModel();

			if ($emp->find($emp_id)) {

SELECT *
FROM `employees`
WHERE `employees`.`id` = '2\n'
DELETE FROM `employees`
WHERE `id` IN ('2\n')
---
	public function deleteEmployee($emp_id)
	{
		$emp = new EmployeeModel();

		$data = $emp->find($emp_id);

		if (!empty($data)) {

			$emp->delete($emp_id);