app/Controllers/Api/UserController.php

                "password" => password_hash($this->request->getVar("password"), PASSWORD_DEFAULT),
            ];

            if ($userModel->insert($data)) {
---
INSERT INTO `users` (`name`, `email`, `phone_no`, `password`) VALUES ('Rosalia', 'rbravo@gmail.com', '612239095', '$2y$10$l9UwC3h3zmKOnBFMFIE24O4dX8G5ynAFwGxygGBdiecjoK2drSely')

    public function login()
    {
        $rules = [
            "email" => "required|valid_email|min_length[6]",
            "password" => "required",
        ];

        $messages = [
            "email" => [
                "required" => "Email required",
                "valid_email" => "Email address is not in format"
            ],
            "password" => [
                "required" => "password is required"
            ],
        ];

        if (!$this->validate($rules, $messages)) {

            $response = [
                'status' => 500,
                'error' => true,
                'message' => $this->validator->getErrors(),
                'data' => []
            ];

        } else {
            $userModel = new UserModel();

            $userdata = $userModel->where("email", $this->request->getVar("email"))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'rbravo@gmail.com'
 LIMIT 1